{
    "abstractText": "The bandits with knapsacks (BwK) framework models online decision-making problems in which an agent makes a sequence of decisions subject to resource consumption constraints. The traditional model assumes that each action consumes a non-negative amount of resources and the process ends when the initial budgets are fully depleted. We study a natural generalization of the BwK framework which allows non-monotonic resource utilization, i.e., resources can be replenished by a positive amount. We propose a best-of-both-worlds primal-dual template that can handle any online learning problem with replenishment for which a suitable primal regret minimizer exists. In particular, we provide the first positive results for the case of adversarial inputs by showing that our framework guarantees a constant competitive ratio α when B = Ω(T ) or when the possible per-round replenishment is a positive constant. Moreover, under a stochastic input model, our algorithm yields an instance-independent Õ(T ) regret bound which complements existing instance-dependent bounds for the same setting. Finally, we provide applications of our framework to some economic problems of practical relevance.",
    "authors": [
        {
            "affiliations": [],
            "name": "REPLENISHABLE KNAPSACKS"
        }
    ],
    "id": "SP:21a1d647c3a2573d2779245431371f567f2db44b",
    "references": [
        {
            "authors": [
                "Shipra Agrawal",
                "Nikhil R Devanur"
            ],
            "title": "Bandits with global convex constraints and objective",
            "venue": "Operations Research,",
            "year": 2019
        },
        {
            "authors": [
                "Shipra Agrawal",
                "Nikhil R Devanur",
                "Lihong Li"
            ],
            "title": "An efficient algorithm for contextual bandits with knapsacks, and an extension to concave objectives",
            "venue": "In 29th Annual Conference on Learning Theory (COLT),",
            "year": 2016
        },
        {
            "authors": [
                "Moshe Babaioff",
                "Shaddin Dughmi",
                "Robert Kleinberg",
                "Aleksandrs Slivkins"
            ],
            "title": "Dynamic pricing with limited supply",
            "venue": "In Proceedings of the 13th ACM Conference on Electronic Commerce,",
            "year": 2012
        },
        {
            "authors": [
                "Ashwinkumar Badanidiyuru",
                "Robert Kleinberg",
                "Yaron Singer"
            ],
            "title": "Learning on a budget: posted price mechanisms for online procurement",
            "venue": "In Proceedings of the 13th ACM conference on electronic commerce,",
            "year": 2012
        },
        {
            "authors": [
                "Ashwinkumar Badanidiyuru",
                "John Langford",
                "Aleksandrs Slivkins"
            ],
            "title": "Resourceful contextual bandits",
            "venue": "In Conference on Learning Theory,",
            "year": 2014
        },
        {
            "authors": [
                "Ashwinkumar Badanidiyuru",
                "Robert Kleinberg",
                "Aleksandrs Slivkins"
            ],
            "title": "Bandits with knapsacks",
            "venue": "J. ACM,",
            "year": 2018
        },
        {
            "authors": [
                "Santiago R Balseiro",
                "Yonatan Gur"
            ],
            "title": "Learning in repeated auctions with budgets: Regret minimization and equilibrium",
            "venue": "Management Science,",
            "year": 2019
        },
        {
            "authors": [
                "Santiago R Balseiro",
                "Haihao Lu",
                "Vahab Mirrokni"
            ],
            "title": "The best of many worlds: Dual mirror descent for online allocation problems",
            "venue": "Operations Research,",
            "year": 2022
        },
        {
            "authors": [
                "Omar Besbes",
                "Assaf Zeevi"
            ],
            "title": "Dynamic pricing without knowing the demand function: Risk bounds and near-optimal algorithms",
            "venue": "Operations Research,",
            "year": 2009
        },
        {
            "authors": [
                "Olivier Bousquet",
                "Manfred K Warmuth"
            ],
            "title": "Tracking a small set of experts by mixing past posteriors",
            "venue": "Journal of Machine Learning Research,",
            "year": 2002
        },
        {
            "authors": [
                "Matteo Castiglioni",
                "Andrea Celli",
                "Christian Kroer"
            ],
            "title": "Online learning with knapsacks: the best of both worlds",
            "venue": "In International Conference on Machine Learning,",
            "year": 2022
        },
        {
            "authors": [
                "Matteo Castiglioni",
                "Andrea Celli",
                "Alberto Marchesi",
                "Giulia Romano",
                "Nicola Gatti"
            ],
            "title": "A unifying framework for online optimization with long-term constraints",
            "venue": "In Advances in Neural Information Processing Systems,",
            "year": 2022
        },
        {
            "authors": [
                "Matteo Castiglioni",
                "Andrea Celli",
                "Christian Kroer"
            ],
            "title": "Online bidding in repeated non-truthful auctions under budget and roi constraints",
            "venue": "arXiv preprint arXiv:2302.01203,",
            "year": 2023
        },
        {
            "authors": [
                "Andrea Celli",
                "Matteo Castiglioni",
                "Christian Kroer"
            ],
            "title": "Best of many worlds guarantees for online learning with knapsacks",
            "venue": "arXiv preprint arXiv:2202.13710,",
            "year": 2023
        },
        {
            "authors": [
                "Nicolò Cesa-Bianchi",
                "Pierre Gaillard",
                "Gábor Lugosi",
                "Gilles Stoltz"
            ],
            "title": "Mirror descent meets fixed share (and feels no regret)",
            "venue": "In Proceedings of the 25th International Conference on Neural Information Processing Systems - Volume",
            "year": 2012
        },
        {
            "authors": [
                "Nicolò Cesa-Bianchi",
                "Tommaso Cesari",
                "Roberto Colomboni",
                "Federico Fusco",
                "Stefano Leonardi"
            ],
            "title": "Bilateral trade: A regret minimization perspective",
            "venue": "Mathematics of Operations Research,",
            "year": 2023
        },
        {
            "authors": [
                "Boxiao Chen",
                "David Simchi-Levi",
                "Yining Wang",
                "Yuan Zhou"
            ],
            "title": "Dynamic pricing and inventory control with fixed ordering cost and incomplete demand information",
            "venue": "Management Science,",
            "year": 2022
        },
        {
            "authors": [
                "Xin Chen",
                "David Simchi-Levi"
            ],
            "title": "Coordinating inventory control and pricing strategies with random demand and fixed ordering cost: The finite horizon case",
            "venue": "Operations research,",
            "year": 2004
        },
        {
            "authors": [
                "Richard Combes",
                "Chong Jiang",
                "Rayadurgam Srikant"
            ],
            "title": "Bandits with budgets: Regret lower bounds and optimal algorithms",
            "venue": "ACM SIGMETRICS Performance Evaluation Review,",
            "year": 2015
        },
        {
            "authors": [
                "Giannis Fikioris",
                "Éva Tardos"
            ],
            "title": "Approximately stationary bandits with knapsacks",
            "venue": "arXiv preprint arXiv:2302.14686,",
            "year": 2023
        },
        {
            "authors": [
                "Elad Hazan",
                "Comandur Seshadhri"
            ],
            "title": "Adaptive algorithms for online decision problems",
            "venue": "In Electronic colloquium on computational complexity (ECCC),",
            "year": 2007
        },
        {
            "authors": [
                "Elad Hazan"
            ],
            "title": "Introduction to online convex optimization, volume 2",
            "venue": "Now Publishers,",
            "year": 2016
        },
        {
            "authors": [
                "Mark Herbster",
                "Manfred K Warmuth"
            ],
            "title": "Tracking the best expert",
            "venue": "Machine learning,",
            "year": 1998
        },
        {
            "authors": [
                "Nicole Immorlica",
                "Karthik Sankararaman",
                "Robert Schapire",
                "Aleksandrs Slivkins"
            ],
            "title": "Adversarial bandits with knapsacks",
            "venue": "J. ACM,",
            "year": 2022
        },
        {
            "authors": [
                "Raunak Kumar",
                "Robert Kleinberg"
            ],
            "title": "Non-monotonic resource utilization in the bandits with knapsacks problem",
            "venue": "In Advances in Neural Information Processing Systems (NeurIPS),",
            "year": 2022
        },
        {
            "authors": [
                "Xiaocheng Li",
                "Chunlin Sun",
                "Yinyu Ye"
            ],
            "title": "The symmetry between arms and knapsacks: A primaldual approach for bandits with knapsacks",
            "venue": "In ICML,",
            "year": 2021
        },
        {
            "authors": [
                "Roger B Myerson",
                "Mark A Satterthwaite"
            ],
            "title": "Efficient mechanisms for bilateral trading",
            "venue": "Journal of economic theory,",
            "year": 1983
        },
        {
            "authors": [
                "Gergely Neu"
            ],
            "title": "Explore no more: Improved high-probability regret bounds for non-stochastic bandits",
            "venue": "Advances in Neural Information Processing Systems,",
            "year": 2015
        },
        {
            "authors": [
                "Karthik Abinav Sankararaman",
                "Aleksandrs Slivkins"
            ],
            "title": "Combinatorial semi-bandits with knapsacks",
            "venue": "In International Conference on Artificial Intelligence and Statistics,",
            "year": 2018
        },
        {
            "authors": [
                "Aleksandrs Slivkins",
                "Karthik Abinav Sankararaman",
                "Dylan J Foster"
            ],
            "title": "Contextual bandits with packing and covering constraints: A modular lagrangian approach via regression",
            "venue": "In The Thirty Sixth Annual Conference on Learning Theory,",
            "year": 2023
        },
        {
            "authors": [
                "William Vickrey"
            ],
            "title": "Counterspeculation, auctions, and competitive sealed tenders",
            "venue": "The Journal of finance,",
            "year": 1961
        },
        {
            "authors": [
                "Zizhuo Wang",
                "Shiming Deng",
                "Yinyu Ye"
            ],
            "title": "Close the gaps: A learning-while-doing algorithm for single-product revenue management problems",
            "venue": "Operations Research,",
            "year": 2014
        },
        {
            "authors": [
                "Xiaohan Wei",
                "Hao Yu",
                "Michael J Neely"
            ],
            "title": "Online primal-dual mirror descent under stochastic constraints",
            "venue": "Proceedings of the ACM on Measurement and Analysis of Computing Systems,",
            "year": 2020
        },
        {
            "authors": [
                "Hao Yu",
                "Michael Neely",
                "Xiaohan Wei"
            ],
            "title": "Online convex optimization with stochastic constraints",
            "venue": "Advances in Neural Information Processing Systems,",
            "year": 2017
        }
    ],
    "sections": [
        {
            "heading": "1 INTRODUCTION",
            "text": "We study online learning problems in which a decision maker tries to maximize their cumulative reward over a time horizon T , subject to a set of m resource-consumption constraints. At each t, the decision maker plays an action xt ∈ X , and subsequently observes a realized reward ft(xt), with ft : X → [0, 1], and an m-dimensional vector of resource consumption ct(xt). Our framework extends the well-known Bandits with Knapsacks (BwK) framework of Badanidiyuru et al. (2018). In the BwK model, the resource consumption is monotonic (i.e., ct(·) ∈ [0, 1]m for all t ∈ [T ]). This framework has numerous motivating applications ranging from dynamic pricing to online ad allocation (see, e.g., Besbes and Zeevi (2009); Babaioff et al. (2012); Wang et al. (2014); Badanidiyuru et al. (2012); Combes et al. (2015)), and it has been extended in numerous directions such as modeling adversarial inputs Immorlica et al. (2022) and other non-stationary input models Celli et al. (2023); Fikioris and Tardos (2023), more general notions of resources and constraints Agrawal and Devanur (2019), contextual and combinatorial bandits Badanidiyuru et al. (2014); Agrawal et al. (2016); Sankararaman and Slivkins (2018).\nKumar and Kleinberg (2022) recently proposed a natural generalization of the BwK model in which resource consumption can be non-monotonic, i.e., , resources can be replenished over time so costs are ct(xt) ∈ [−1, 1]m. We call such model Bandits with Replenishable Knapsacks (BwRK). Kumar and Kleinberg (2022) focus on the stochastic setting, while we are interested in providing best-of-both-worlds algorithms that provide guarantees under both stochastic and adversarial inputs.\nContributions. We propose a general primal-dual template that can handle online learning problems in which the decision maker has to guarantee some long-term resource-consumption constraints and resources can be renewed over time. We show that our framework provides best-of-both-worlds guarantees in the spirit of Balseiro et al. (2022): it guarantees a regret bound of Õ(T 1/2) in the case in which (ft, ct) are i.i.d. samples from a fixed but unknown distribution, and it guarantees a constant-factor competitive ratio in the case in which budgets grow at least linearly in T , or when the possible per-round replenishment is a positive constant. We remark that known best-of-both-worlds frameworks like the one by Balseiro et al. (2022) cannot be applied to this setting as they assume\nmonotonic resource consumption. In that case, we show that our framework recovers the state-ofthe-art rate of 1/ρ by Castiglioni et al. (2022a), where ρ is the per-iteration budget. Our primal-dual template is applicable to any online problem for which a suitable primal regret minimizer is available. Therefore, we first provide general guarantees for the framework without making any assumption on the primal and dual regret minimizers being employed (Section 4). Then, we show how such regret minimizers should be chosen depending on the information available to the learner about the intensity of the budget replenishment (Section 5). Moreover, we provide explicit bounds that only depend on the guarantees of the primal regret minimizer. In particular, we show how the primal and dual minimizers should be instantiated in the case in which the amount of resources that can be replenished at each time t is known, and in the more challenging case in which it is unknown a-priori to the decision maker. Finally, we demonstrate the flexibility of our framework by instantiating it in some relevant settings (Section 6). First, we instantiate the framework in the BwRK model by Kumar and Kleinberg (2022), thereby providing the first positive results for BwRK under adversarial inputs, and the first instance-independent regret bound for the stochastic setting. The latter complements the instance-dependent analysis by Kumar and Kleinberg (2022). Then, we apply the framework to a simple inventory management problem, and to revenue maximization in bilateral trade.\nRelated works. Primal-dual approaches for bandit problems with resource-consumption constraints popularized by the work of Immorlica et al. (2022) cannot be applied in our setting. Such primal-dual approaches (see also Castiglioni et al. (2022a); Balseiro et al. (2022); Balseiro and Gur (2019)) usually require as an input the Slater’s parameter of the problem (i.e., in their setting, the per-round budget). This is not the case in our setting since the amount by which each constraints is replenished is a priori unknown. This issue has been effectively addressed in stochastic settings where sublinear constraints violations are allowed, such as online optimization under stochastic inputs (see, e.g., , Yu et al. (2017); Wei et al. (2020)), and stochastic online learning problems with long-term constraints Castiglioni et al. (2022b); Slivkins et al. (2023). However, in BwK problems constraints are required to be satisfied strictly at all rounds. Addressing this issue in the adversarial setting is considerably more challenging and this direction remains largely unexplored. A notable exception is the recent work by Castiglioni et al. (2023). Such works focuses on a setting with only one monotone budget constraint, for which Slater’s parameter is known, and one “soft” return-on-investments (ROI) constraints (i.e., ROI constraints can be violated up to a sublinear amount). Being allowed to violated the ROI constrain renders the problem significantly simpler than ours, where budget constraints must be strictly satisfied at each time t. Moreover, our framework can handle an arbitrary number of constraints, while Castiglioni et al. (2023) can only manage one unknown feasibilty parameter. Finally, we mention that in the case of stochastic inputs other approaches for budget-management problems are known, most notably optimism-under-uncertainty Agrawal and Devanur (2019); Badanidiyuru et al. (2018)."
        },
        {
            "heading": "2 PRELIMINARIES",
            "text": "Vectors are denoted by bold fonts. Given vector x, let x[i] be its i-th component. The set {1, . . . , n}, with n ∈ N>0, is denoted as [n]. Finally, given a discrete set S, we denote by ∆S the |S|-simplex."
        },
        {
            "heading": "2.1 BASIC SET-UP",
            "text": "There are T rounds and m resources. The decision maker has an arbitrary non-empty set of available strategies X . In each round t ∈ [T ], the decision maker chooses xt ∈ X , and subsequently observes a reward function ft : X → [0, 1], and a function ct : X → [−1, 1]m specifying the consumption or replenishment of each of the m resources. Each resource i ∈ [m] is endowed with an initial budget of B to be spent over the T steps. 1 We denote by ρ the per-iteration budget, which is such that B = Tρ, and we let ρ := ρ1 ∈ Rm>0. For i ∈ [m] and x ∈ X , if ct,i(x) < 0 we say that at time t action x restores a positive amount to the budget available for the i-th resource. If ct,i(x) > 0, we say that action x at time t depletes some of the available budget for the i-th resource.\nLet γt := (ft, ct) be the input pair at time t, and γT := (γ1, γ2, . . . , γT ) be the sequence of inputs up to time T . The repeated decision making process stops at the end of the time horizon T . The goal of the decision maker is to maximize the cumulative reward ∑T t=1 ft(xt) while satisfying the\n1For ease of notation we consider a uniform intial buget, but the case of different initial budgets easily follows from our results.\nresource constraints ∑T t=1 ct,i(xt) ≤ T · ρ for each i ∈ [m]. Given two functions f : X → R and c : X → Rm, we denote by Lf,c : X × Rm≥0 → R the Lagrangian function defined as\nLf,c(x,λ) := f(x) + 〈λ,ρ− c(x)〉 for all x ∈ X ,λ ∈ Rm≥0. Given X , the set of strategy mixtures Ξ is the set of probability measures on the Borel sets of X ."
        },
        {
            "heading": "2.2 BASELINE ADVERSARIAL SETTING",
            "text": "Given a sequence of inputs γT selected by an oblivious adversary, the baseline for the adversarial setting is OPTγ := supx∈X ∑T t=1 ft(x), which is the total expected reward of the best fixed unconstrained strategy in hindsight belonging to X . Moreover, for any sequence of inputs γT , and t ∈ [T ], let f̃t : X → [0, 1] and c̃t : X → [−1, 1]m be such that:\nf̃t(x) := 1 t ∑t s=1 fs(x) and c̃t(x) := 1 t ∑t s=1 cs(x), ∀x ∈ X . (2.1)\nThen, for t ∈ [T ], we define OPTf̃t := supx∈X f̃t(x), and the baseline for the adversarial setting can be rewritten as OPTγ = T ·OPTf̃T . In the setting with monotonic resource utilization and adversarial inputs, previous work usually employs weaker baselines (see, e.g., Immorlica et al. (2022); Castiglioni et al. (2022a;b)). For example, Castiglioni et al. (2022a) considers the reward attained by the best fixed strategy mixture until budget depletion, after which the void action is played. We show that, despite the stronger baseline, we match the state-of-the-art 1/ρ competitive-ratio by Castiglioni et al. (2022a) when constraints are monotonic. We will work under the following standard assumption. Assumption 2.1. There exists a void action ∅ ∈ X and a constant β ≥ 0 such that ct,i(∅) ≤ −β, for all resources i ∈ [m] and t ∈ [T ].\nNotice that when β = 0 we recover the standard assumption of BwK (see, e.g., Badanidiyuru et al. (2018)). We will often parametrize regret bounds using ν := β + ρ. This parameter measures how much budget is available at each iteration, and how fast the available budget can be replenished."
        },
        {
            "heading": "2.3 BASELINE STOCHASTIC SETTING",
            "text": "In the stochastic version of the problem, each input γt = (ft, ct) is drawn i.i.d. from some fixed but unknown distribution P over a set of possible input pairs. Let f̄ : X → [0, 1] be the expected reward function, and c̄ : X → [−1, 1]m be the expected resource-consumption function (where both expectations are taken with respect to P).\nGiven two arbitrary measurable functions f : X → [0, 1], c : X → [−1, 1]m, we define the following linear program, which chooses the strategy mixture ξ that maximizes the reward f , while keeping the expected consumption of every resource i ∈ [m] given c below a target ρ:\nOPTLPf,c :=\n{ sup ξ∈Ξ Ex∼ξ[f(x)]\ns.t. Ex∼ξ[c(x)] ρ , (2.2)\nIn the stochastic setting, our baseline is OPTLP f̄ ,c̄ . It is well-known that T · OPTLP f̄ ,c̄ is an upper bound on the expected reward of any algorithm (see, e.g., , (Badanidiyuru et al., 2018, Lemma 3.1) and (Kumar and Kleinberg, 2022, Lemma 2.1)). Lemma 2.2 (Lemma 2.1 of Kumar and Kleinberg (2022)). In the stochastic setting, the total expected reward of any algorithm is at most T · OPTLP\nf̄ ,c̄ .\nIn the stochastic setting we make the same “positive drift” assumption of Kumar and Kleinberg (2022), which is weaker than our Assumption 2.1 in the adversarial case. Assumption 2.3. There exists of a void action ∅ ∈ X such that, for all resources i ∈ [m], it holds that E[ci(∅)] ≤ −β and P[ci(∅) ≤ 0] = 1, where β ≥ 0 and the expectation is with respect to the draw of the c from P."
        },
        {
            "heading": "2.4 REGRET MINIMIZATION",
            "text": "We will consider regret minimizers for a set W as generic algorithms that implements two functions: (i) the function NEXTELEMENT() returns an element wt ∈ W , and (ii) the function\nAlgorithm 1 Primal-Dual template 1: Input: parameters B, T ; regret minimizers AP and AD 2: Initialization: B1,i ← B, ∀i ∈ [m]; initialize AP,AD; TG = {∅}, T∅ = {∅}. 3: for t = 1, 2, . . . , T do 4: if ∃ i ∈ [m] : Bt,i < 1 then 5: T∅ ← T∅ ∪ {t} 6: Primal action: xt ← ∅ 7: Observe costs: Observe ct(∅) and update available resources: Bt+1 ← Bt − ct(∅) 8: else 9: TG ← TG ∪ {t} 10: Dual decision: λt ← AD.NEXTELEMENT() 11: Primal decision: xt ← AP.NEXTELEMENT() 12: Observe cost: Observe ct(xt) and update available resources: Bt+1 ← Bt − ct(xt) 13: Primal update:\n• uPt (xt)← ft(xt) + 〈λt,ρ− ct(xt)〉 • AP.OBSERVEUTILITY(uPt (xt))\n14: Dual update: • uDt : Rd 3 λ 7→ 〈λ, ct(xt)− ρ〉 • AD.OBSERVEUTILITY(uDt )\nOBSERVEUTILITY(·) which takes some feedback and updates the internal state of the regret minimizer. In the full-feedback model the regret minimizer observes as feedback a function ut : X → R, while in the bandit-feedback model it observes only the realized ut(wt). The standard objective of a regret minimizer is to control the cumulative regret with respect to a set Y ⊆ W defined as RT (Y) := supw∈Y ∑T t=1(ut(w) − ut(wt)). In the following, we will also exploit a more general notion of regret, in which the regret minimizer suffers regret only in specific rounds. In particular, given a subset of rounds T ⊂ [T ] we define RT (Y) := supw∈Y ∑ t∈T (ut(w)− ut(wt)). Then, we can recover common notions of regret such as standard (external) regret for which T = [T ], and weakly-adaptive regret for which RIT (Y) := supI=[t1,t2]⊆[T ] RI(Y) Hazan and Seshadhri (2007). We remove the dependency from Y when Y =W (e.g., we write RT in place of RT (W))."
        },
        {
            "heading": "3 PRIMAL-DUAL TEMPLATE",
            "text": "We assume to have access to two regret minimizers with the following characteristic. A banditfeedback primal regret minimizer AP which outputs a strategy xt ∈ X at each t, and subsequently receives as feedback the realized utility function uPt (xt) = ft(xt) + 〈λt,ρ − ct(xt)〉, and a fullfeedback dual regret minimizer AD that receives as input the utility function: uDt : λ 7→ 〈λ, ct(xt)− ρ〉. note that the dual regret minimizer always has full feedback by construction.2\nAlgorithm 1 summarizes the structure of our primal-dual template. For each t, if the available budget Bt,i is less than 1 for some resource i, the algorithm plays the void action ∅ and updates the budget accordingly. This ensures that the budget will never fall below 0. Otherwise, the regret minimizer plays action xt at time t, which is determined by invoking NEXTELEMENT(). Then, uPt (xt) and u D t are observed, and the budget consumption is updated according to the realized costs ct. If the budget was at least 1, the internal state of the two regret minimizers is updated via OBSERVEUTILITY(·), on the basis of the feedback specified by the primal loss uPt (xt), and the dual loss function u D t . The algorithm terminates when the time horizon T is reached.\nWe partition the set of rounds in two disjoint sets TG ⊆ [T ] and T∅ ⊆ [T ]. The set TG := {t ∈ [T ] : ∀i ∈ [m], Bt,i ≥ 1} includes all the rounds in which all the resources were at least 1, and hence the regret minimizers AP and AD were actually invoked. On the other hand, T∅ := {t ∈ [T ] : ∃i ∈ [m], Bt,i < 1} is the set of rounds in which at least one resource is smaller than 1. Clearly, we have TG ∪ T∅ = [T ]. Then, let τ ∈ T∅ be the last time in which the budget was strictly less then 1 for\n2We focus on the more challenging bandit-feedback setting. Our results easily extend to full-feedback.\nat least one resource, i.e., τ = max T∅. We partition TG in two sets TG,<τ and TG,>τ which are the rounds in TG before and after τ , respectively. Formally, TG,<τ := [τ ] \\ T∅, and TG,>τ := [T ] \\ [τ ]. We denote by RPT (resp., R D T ) the cumulative regret incurred by AP (resp., AD). Following the notation introduced in Section 2.4 we will write RPTG to denote the regret accumulated by the primal regret minizer over time steps in TG. Let D := {λ ∈ Rd+ : ‖λ‖1 ≤ 1/ν}. We consider the regret of the dual in the set of rounds TG,<τ and TG,>τ , with respect to the action set D. Formally, RDTG,<τ (D) = supλ∈D ∑ t∈TG,<τ u D t (λ)− uDt (λt). The term RDTG,>τ is defined analogously. Finally, let M := maxt ‖λt‖1 be the largest value of the `1-norm of dual multipliers over the time horizon."
        },
        {
            "heading": "4 GENERAL GUARANTEES OF THE PRIMAL-DUAL TEMPLATE",
            "text": "In this section, we provide no-regret guarantees of the general template described in Algorithm 1."
        },
        {
            "heading": "4.1 ADVERSARIAL SETTING",
            "text": "We start by describing the guarantees of Algorithm 1 in the adversarial setting. The idea is that, since τ corresponds to the last time in which at least one resource had Bt,i < 1, it must be the case that the primal “spent a lot” during the time intervals before τ in which it played (i.e., TG,<τ ). Ideally, the dual regret minimizer should adapt to this behavior and play a large λ in TG,<τ , thereby attaining a large cumulative utility in TG,<τ . We show that the Lagrange multipliers in D are enough for this purpose. Then, as soon as we reach t > τ , the dual should adapt and start to play a small λ. Indeed, during these rounds the primal regret minimizer gains resources and therefore the optimal dual strategy would be setting λ = 0. The effectiveness of the dual regret minimizer in understanding in which phase it is playing, and in adapting to it by setting high/small penalties, is measured by the size of the regret terms RDTG,<τ (D) and R D TG,>τ (D). In particular, R D TG,<τ (D) (resp., R D TG,>τ (D)) is low if the dual regret minimizer behaves as expected before τ (resp., after τ). Intuitively, if AD guarantees that those terms are small, then the dual regret minimizer is able to react quickly to the change in the behavior of the primal player before and after τ . As a byproduct of this, we show that the part of the primal’s cumulative utility due to the Lagrangian penalties is sufficiently small. At the same time, we know that the primal regret minimizer has regret at most RPTG with respect to a strategy mixture that plays the optimal fixed unconstrained strategy with probability ν/(1 + β), and the void action otherwise. This strategy mixture guarantees a ν/(1 + β) fraction of the optimal utility without violating the constraints at any rounds. Formally, we can show the following.3\nTheorem 4.1. Let α := ν/(1 + β). In the adversarial setting, Algorithm 1 outputs a sequence of actions (xt)Tt=1 such that∑\nt∈[T ]\nft(xt) ≥ α · OPTγ − ( 2\nν + RDTG,<τ (D) + R D TG,>τ (D) + R P TG\n) .\nNotice that, in the case of β = 0, we recover the standard guarantees of adversarial bandits with knapsacks for the case in which B = Ω(T ) Castiglioni et al. (2022a), where the competitive ratio α is exactly ρ. The possibility of replenishing resources yields an improved competitive ratio.\nRemark. In order for Theorem 4.1 to provide a meaningful bound, we need the three regret terms on the right-hand side to be suitably upperbounded by some term sublinear in T (see Section 5). Since the time steps in TG are the only rounds in which AP is invoked, any standard regret minimizer can be used to bound RPTG . However, the same does not holds for A\nD. Indeed, we need a regret minimizer which can provide suitable regret upper bounds to RDTG,<τ (D) and R D TG,>τ (D), at the same time. One cannot simply bound RDTG,<τ (D) + R D TG,>τ (D) by R D TG(D), since the best action in the sets TG,<τ and TG,>τ may differ. Standard regret minimizers usually do not provide this guarantee, so we need special care in choosing AD. In particular, we need a weakly adaptive dual regret minimizer.\n3All omitted proofs can be found in the appendix."
        },
        {
            "heading": "4.2 STOCHASTIC SETTING",
            "text": "In this setting, we can exploit stochasticity of the environment to show that the expected utility of the primal under the sequence of realized inputs γ = (ft, ct)Tt=1 is close to the primal expected utility at (f̄ , c̄), and to provide a suitable upperbound to the amount by which each resource is replenished during T∅. Given δ ∈ (0, 1], let ET,δ := √ 8T log (4mT/δ). Lemma 4.2. For any ξ ∈ Ξ and δ ∈ (0, 1], with probability at least 1− δ, it holds that:∑ t∈T∅ ct,i(∅) ≤ −β|T∅|+MET,δ, ∀i ∈ [m], and (4.1)\nEx∼ξ [∑ t∈TG ft(x) + 〈λt,ρ− ct(x)〉 ] ≥ E x∼ξ [∑ t∈TG f̄(x) + 〈λt,ρ− c̄(x)〉 ] −MET,δ. (4.2)\nThen, we can prove the following regret bound. Theorem 4.3. Let the inputs (ft, ct) be i.i.d. samples from a fixed but unknown distribution P. For δ ∈ (0, 1], we have that with probability at least 1− δ, it holds\nT∑ t=1 ft(xt) ≥ T · OPTLPf̄ ,c̄ − ( 2 ν + 1 ν ET,δ + R D TG,<τ (D) + R D TG,>τ (D) + R P TG ) .\nThe proof follows a similar approach to the one of Theorem 4.1, with two main differences. First, we can now exploit standard concentration inequalities to relate realizations of random variables with their mean. Second, we exploit the fact that the primal has regret at most RPTG against an optimal solution to OPTLP\nf̄ ,c̄ , which is feasible in expectation and has an expected utility that matches the value\nof our baseline. This allows us to obtain competitive-ratio equal to 1 in the stochastic setting."
        },
        {
            "heading": "5 CHOOSING APPROPRIATE REGRET MINIMIZERS",
            "text": "In order to have meaningful guarantees in both the adversarial and stochastic setting, we need to choose the regret minimizers AP and AD so that RPTG , R D TG,<τ (D) and R D TG,>τ (D) all grow sublinearly in T . In the following section we will discuss two different scenarios, which differ in the amount of information which the decision maker is required to have. In Section 5.1 we are going to assume that the decision maker knows the per-round replenishment factor β. Then, in Section 5.2, we will show that this assumption can be removed by employing a primal regret minimizer AP with slightly stronger regret guarantees. In both cases, the dual regret minimizer AD has to be weakly adaptive, since both terms RDTG,<τ (D) and R D TG,>τ (D) need to be sublinear in T . On the other hand, we will make minimal assumptions on the primal regret minimizer AP. Its choice largely depends on the application considered, as we show in Section 6. In general, the primal regret minimizer must meet the minimal requirement of guaranteeing a sublinear regret upper bound EPT,δ with probability at least 1− δ, when the adversarial rewards are in [0, 1]."
        },
        {
            "heading": "5.1 IMPLEMENTING ALGORITHM 1 WITH KNOWN REPLENISHMENT FACTOR",
            "text": "We start by assuming that the decision maker knows β or, more generally, a lower bound β̃ on it. Therefore, the algorithm can compute ν, or its lower bound. When β̃ is known, we can instantiate the regret minimizer AD to play on the set D̃ := {λ ∈ Rd+ : ‖λ‖1 ≤ 1/ν̃} ⊇ D, where ν̃ := β̃ + ρ ≤ ν. As discussed above, the dual regret minimizer on the set of Lagrange multipliers D must be weakly adaptive. This can be achieved via variations of the fixed share algorithm proposed by Herbster and Warmuth (1998). We will employ the generalized share algorithm of Bousquet and Warmuth (2002) and the analysis of Cesa-Bianchi et al. (2012), as AD has full feedback by construction.\nThe set D̃ can be written as D̃ = co {0, 1/ν̃1i with i ∈ [m]}, where 1i is the i-th standard basis vector, and co denotes the convex hull. Since D ⊆ D̃, achieving no-weakly-adaptive regret with respect to D̃ implies the same result for D. Thus, instantiating the fixed-share algorithm on the (m+ 1)-simplex, and since the losses of AP are linear we can prove that: Lemma 5.1 ((Cesa-Bianchi et al., 2012, Corollary 2)). For any 0 < β̃ ≤ β, there exists an algorithm that guarantees max ( RDTG,<τ (D),R D TG,>τ (D) ) ≤ 2ν̃ √ T log (2mT ).\nSince the dual regret minimizer AD can play any Lagrange multiplier λt ∈ D̃, we have that the rewards observed by the primal regret minimizer AP are in the range [0, 1 + 2/ν̃] because it holds\nsup x∈X ,t∈[T ] |uPt (x)| ≤ sup x∈X ,t∈[T ]\n{ |ft(x)|+ ‖λt‖1 · ‖ρ− ct(x)‖∞ } ≤ 1 + 2\nν̃ ≤ 4 ν̃ .\nWith probability at least δ, the primal regret minimizer AP guarantees a regret EPT,δ against rewards in [0, 1]. Then, by re-scaling the realized rewards before giving them in input to the regret minimizer, we get a regret bound of 4ν̃E P T against rewards u P t (·) that are in [0, 4/ν̃]. This simple construction is applicable because the range of the rewards is known. By combining these observations we can easily recover the following corollary of Theorem 4.1 and Theorem 4.3.\nCorollary 5.2. Assume that the dual regret minimizer is generalized fixed share on D̃, and that the primal regret minimizer has regret at most EPTG,δ against losses in [0, 1] with probability at least 1− δ, for δ ∈ (0, 1]. In the adversarial setting, for any β̃ ≤ β, with probability at least 1− δ Algorithm 1 guarantees that ∑\nt∈[T ]\nft(xt) ≥ αOPTγ − ( 2\nν +\n1\nν̃\n√ T log (2mT ) + 4\nν̃ EPTG,δ\n) ,\nwhere α = ν/1+β. In the stochastic setting, with probability at least 1− 2δ, Algorithm 1 guarantees∑ t∈[T ] ft(xt) ≥ T · OPTLPf̄ ,c̄ − ( 2 ν + 1 ν ET,δ + 1 ν̃ √ T log (2mT ) + 4 ν̃ EPTG,δ ) ."
        },
        {
            "heading": "5.2 IMPLEMENTING ALGORITHM 1 WITH UNKNOWN REPLENISHMENT FACTOR",
            "text": "In this section we will show how to implement Algorithm 1 when no information about the per-round replenishment factor β is available. This impacts both the primal and the dual regret minimizer. Differently from the previous section, we cannot instantiate the regret minimizer AD directly on D (or on a larger set D̃) since we do not know such set. Therefore, we need a dual regret minimizer that plays on Rm+ , but has sublinear weakly-adaptive regret with respect to Lagrange multipliers in D. To achieve this, we can use the Online Gradient Descent (OGD) algorithm, instantiated on Rm+ with starting point λ0 = 0. Indeed, it is well known that OGD guarantees that the regret on any interval of rounds [t1, t2] ⊆ [T ] is upper bounded by the `2 distance between the point played at t1 and the comparator. In our setting this is equivalent to the following lemma (Hazan et al., 2016, Chapter 10). Lemma 5.3. For any TG ⊂ [T ] and any t1, t2 ∈ TG, if the dual regret minimizer is OGD with learning rate η, we have that the regret with respect to λ is upper bounded by\nRDTG∩[t1,...,t2]({λ}) ≤ ‖λ− λt1‖22\n2η +\n1 2 ηmT.\nIn this setting, we also need additional assumptions on the primal regret minimizer AP. Formally we need an algorithm that satisfies the following condition. Condition 5.4. We assume that, for any T = [t1, t2] ⊆ [T ], the weakly-adaptive regret of AP facing adversarial losses with unknown range L is upper bounded by L2EPT,δ with probability at least 1− δ, where EPT,δ is independent from the range of payoffs.\nIn order to provide the final regret bound for this setting, we need to show that the size of Lagrange multipliers remains bounded by a suitable term. Lemma 5.5. Assume that the dual regret minimizer is OGD on Rm+ with η = (k1ET,δ + k2mEPT,δ + 2m √ T )−1, where k1, k2 are absolute constants, and the primal regret minimizer AP satisfies Condition 5.4. Then, both in the adversarial and stochastic setting, the Lagrange multipliers λt played by the dual regret minimizer AD are such that M := supt∈[T ] ‖λt‖1 ≤ 8m/ν.\nThis result extends the similar result of Castiglioni et al. (2023, Theorem 6.2) to the case of multiple constraints. Lemma 5.5 allows us bound the regret RPTG of the primal, and the regret terms R D TG<τ (D) and RDTG>τ (D) of the dual regret minimizer. In particular, for what concerns the dual regret minimizer\nAD, we can bound the maximum distance between Lagrange multipliers which are played by AD. Then, we can bound the regret terms RDTG<τ (D) and R D TG>τ (D) via Lemma 5.3. Similarly, we can bound the regret of the primal through Condition 5.4. Using this observations, together with Theorem 4.1 and Theorem 4.3, we can extend Corollary 5.2 to the case of unknown β. Corollary 5.6. Assume that the dual regret minimizer is OGD on Rm+ with η = (k1ET,δ +k2mEPT,δ + 2m √ T )−1, where k1, k2 are absolute constants, and the primal regret minimizer AP satisfies Condition 5.4. Then, in the adversarial setting, Algorithm 1 guarantees with probability 1− δ that∑ t∈[T ] ft(xt) ≥ α · OPTγ − k3 m4 ν2 ( EPT,δ + ET,δ ) ,\nwhere k3 is an absolute constant and α = ν/1+β. In the stochastic setting, there is an absolute constant k4 such that Algorithm 1 guarantees that, with probability at least 1− 2δ,∑\nt∈[T ]\nft(xt) ≥ T · OPTLPf̄ ,c̄ − k4 m4 ν2 ( EPT,δ + ET,δ ) ."
        },
        {
            "heading": "6 APPLICATIONS",
            "text": "This section demonstrates the flexibility of our framework by studying three well motivated models: BwRK, inventory management, and revenue maximization in bilateral trade."
        },
        {
            "heading": "6.1 BANDITS WITH REPLENISHABLE KNAPSACKS (BWRK)",
            "text": "Consider the standard BwK problem: at each time step t, the learner selects an action it out of K actions (thus X = [K]), suffers a loss `t(it) ∈ [0, 1] and incurs a cost vector ct(it) ∈ [−1, 1]m that specifies the consumption of each one of its m resources. We focus on the most challenging scenario, in which the parameter β is not known. We instantiate the primal-dual framework (Algorithm 1) using EXP3-SIX Neu (2015) as the primal regret minimizer, while online gradient descent is employed as the dual regret minimizer. Castiglioni et al. (2023) show that EXP3-SIX achieve weakly-adaptive regret L2Õ( √ KT ), where L is the range of the observed losses.\nFirst, let’s consider the adversarial case, where losses and cost functions are generated by an oblivious adversary. Assumption 2.1 is verified when there exists a null action ∅ that always yields non-negative resource replenishment (i.e., there exists β ≥ 0 s.t. ct,j(∅) ≤ −β for each resource j and time t). Theorem 6.1. Consider the BwRK problem in the adversarial setting. There exists an algorithm satisfying the following bound on the regret:\nα · OPTγ − ∑ t∈[T ] ft(xt) ≤ Õ ( m4 ν2 √ KT log ( 1 δ )) ,\nwith probability at least 1− δ, where α := ν/(1 + β).\nThis is the first positive result for the BwRK problem in the adversarial setting.\nSecond, we consider a stochastic version, in which losses and cost vectors are drawn i.i.d. from an unknown distribution. In this setting, the void action assumption (Assumption 2.3) requires the existence of a distribution ∅ ∈ ∆K over the actions such that, in expectation over the draws of the cost function, it verifies E[cj(∅)] ≤ −β for all resources j4. The analysis of our primal-dual framework allows us to show that the same learning algorithm presented for the adversarial setting yields the following instance-independent results in the stochastic setting. Theorem 6.2. Consider the BwRK in the stochastic setting. There exists an algorithm satisfying, with probability at least 1− 2δ, the following bound on the regret:\nT · OPTLPf̄ ,c̄ − T∑ t=1 ft(xt) ≤ Õ ( m4 ν2 √ KT log ( 1 δ )) .\n4Note, the role of β is played in Kumar and Kleinberg (2022) by the parameter δslack. Furthermore, there the authors make additional assumptions on the structure of the optimal LP and its solution.\nTheorem 6.2 provides the first instance-independent regret bound under i.i.d. inputs, and it complements the instance-dependent analysis by Kumar and Kleinberg (2022). In particular, in the stochastic setting, they provide a logarithmic instance-dependent bound on the regret of order O(Km2/∆2 log T ), where ∆ is a notion of suboptimality gap (already present in Li et al. (2021)), which in principle may be arbitrarily small. Although our work does not offer instance-dependent logarithmic bounds on the regret, we advance the study of the BwRK problem along three main directions: i) we design an algorithm which handles at the same time both stochastic and adversarial inputs (while Kumar and Kleinberg (2022) only deal with the stochastic input model), ii) our primal-dual approach is arguably simpler, and iii) we provide the first worst-case dependence on the time horizon T ."
        },
        {
            "heading": "6.2 ECONOMIC APPLICATIONS AND DISCUSSION",
            "text": "In the following, we describe two additional economic applications where our framework can be applied in the stochastic setting. We conclude the section by describing the challenges in extending these specific results to the adversarial setting.\nInventory management. As a simple application of our techniques, consider the following inventory management problem. Each day t, a shopkeeper is confronted with a decision: either open for business and attempt to sell the goods it has in the store, or travel to its supplier in order to restore its inventory. This simplified model captures many real world application that contemplates the trade-off between exploiting the available inventory, and “skipping a turn” to replenish it. For the sake of clarity we restrict ourselves to the case of a single resource and supplier, however this could be easily extended to more general instances. Formally, the goods in stock at day t are Bt ≥ 0, and the shopkeeper has a set two actions X = {o, s}. Action o corresponds to opening for business with reward rt(o) ∈ [0, 1] and inventory consumption ct(o) ∈ [0, 1], while action s corresponds to going to the supplier, with rt(s) ∈ [−1, 0] and negative resource consumption ct(s) ∈ [−1, 0] which both depend on the supplier’s availability and current price. Clearly, it is possible to select action o only if Bt ≥ 1, while action s plays the role of the void action ∅. We focus of the stochastic case in which E[ct(s)] ≤ −β, where β is the expected amount of good available from the supplier. By employing EXP-SIX as in Section 6.1, this immediately yields a Õ( √ T ) regret bound via Corollary 5.6.\nBilateral trade. We consider the well known bilateral trade model (Vickrey, 1961; Myerson and Satterthwaite, 1983; Cesa-Bianchi et al., 2023): each day, the merchant posts two prices, a price pt ∈ R+ and a price qt ∈ R+ to a seller and a buyer of a good, respectively. The seller (resp., the buyer) has a private valuation of st ∈ [0, 1] (resp., bt ∈ [0, 1]). If the valuation st is smaller than pt, then the merchant buys one unit of good from the seller, while if the valuation bt is larger than the price qt (and there is some inventory left) then the merchant sells a unit of the good to the buyer. The merchant can only sell a good if Bt ≥ 1, i.e., the inventory has at least one unit of it. Moreover, we assume that the merchant has no initial budget, i.e., B1 = 0. The merchant’s revenue at time t is revt(pt, qt) := (qt − pt)1[qt ≤ bt]1[st ≤ pt]. Similarly, for any t ∈ [T ], the stock consumption is updated as follows: Bt+1 = Bt − 1[qt ≤ bt] + 1[st ≤ pt]. Therefore, the strategy of choosing pt = 1 and qt > 1 surely increases the budget by one unit, and it has revenue revt(pt, qt) = −1. This strategy plays the role of the void action ∅, with per-round replenishment β = 1. Similarly to the example above, in the stochastic setting it is enough to translate and re-scale the revenue to satisfy all the assumptions of our algorithm. This immediately yields the Õ( √ T ) regret guarantees.\nChallenges of the adversarial setting. In the case in which rewards are allowed to be negative and inputs are adversarial, the simple simple trick of suitably re-scaling and translating the utilities is not applicable. This is due to the fact that our algorithm guarantees a multiplicative approximation of the benchmark and this multiplicative factor is not invariant with respect to translations. We leave as an open problem the question of how to handle application scenarios in which rewards may be negative in the adversarial setting. Addressing this challenge would likely necessitate the development of novel techniques to resolve the issue. We observe that the results for the adversarial setting would be preserved if we could provide a void action ∅ that has non-negative reward and negative cost, but this is not usually the case in practical applications. Finally, it would be interesting to extend the simplified inventory-management model which we discussed to more complex models which have been proposed in the operations research literature (see, e.g., Chen et al. (2022); Chen and Simchi-Levi (2004))."
        },
        {
            "heading": "A PROOFS OMITTED FROM SECTION 4.1",
            "text": "Theorem 4.1. Let α := ν/(1 + β). In the adversarial setting, Algorithm 1 outputs a sequence of actions (xt)Tt=1 such that∑\nt∈[T ]\nft(xt) ≥ α · OPTγ − ( 2\nν + RDTG,<τ (D) + R D TG,>τ (D) + R P TG\n) .\nProof. We divided the proof in two steps. First, we show that over the rounds TG in which the regret minimizers play the “lagrangified” cumulative costs is controlled. Then, in the second step, we show that over the same set of rounds TG the “lagrangified” utility is large. In order to simplify the notation, we will write RDTG,<τ (resp., R D TG,>τ ) in place of R D TG,<τ (D) (resp., R D TG,>τ (D)).\nPart 1. First, we show that in TG,<τ the budget spent by the decision maker is sufficiently high. Let i∗ be the resource that had the lowest budget in round τ ∈ T∅. Summing the budget equation Bt+1,i∗ = Bt,i∗ − ct,i∗(xt) over t = {1, . . . , τ − 1}, gives us\nBτ,i∗ −Bi∗ = − ∑ t≤τ−1 ct,i∗(xt).\nSince by definition Bτ,i∗ < 1 and B1,i∗ = B we get that:∑ t≤τ−1 ct,i∗(xt) > B − 1. (A.1)\nMoreover, in rounds t ∈ T∅, since the budget was strictly less we have by construction that xt = ∅, and thus ct,i∗(xt) ≤ −β. This readily implies that:∑\nt∈T∅\nct,i∗(xt) ≤ −β|T∅|. (A.2)\nBy combining Equation (A.1) and Equation (A.2) we obtain that:∑ t∈TG,<τ ct,i∗(xt) = ∑ t∈[τ ] ct,i∗(xt)− ∑ t∈T∅ ct,i∗(xt) (A.3)\n≥ B − 2 + β|T∅|. (A.4) Since the budget spent in rounds TG,<τ is large, it must be the case that the dual regret minimizer AD collects a large cumulative utility in those rounds. Formally, the regret RDTG,<τ of A\nD on rounds TG,<τ with respect to λ = 1ν1i∗ reads as follows∑ t∈TG,<τ 〈λt, ct(xt)− ρ〉 ≥ 1 ν ∑ t∈TG,<τ (ct,i∗(xt)− ρi∗)− RDTG,<τ\n≥ 1 ν (B − 2 + β|T∅| − |TG,<τ |ρi∗)− RDTG,<τ = 1\nν (ρi∗T − 2 + β|T∅| − |TG,<τ |ρi∗)− RDTG,<τ\n= 1\nν (ρi∗(|TG,<τ |+ |T∅|+ |TG,>τ |)− 2 + β|T∅| − |TG,<τ |ρi∗)− RDTG,<τ\n= 1\nν (ν|T∅|+ ρi∗ |TG,>τ | − 2)− RDTG,<τ\n≥ 1 ν (ν|T∅| − 2)− RDTG,<τ = |T∅| − 2\nν − RDTG,<τ . (A.5)\nThen, by considering λ = 0 and the definition of the regret on TG,>τ we get that the utility of dual is bounded by: ∑\nt∈TG,>τ\n〈λt, ct(xt)− ρ〉 ≥ −RDTG,>τ . (A.6)\nThus, by combining the inequalities of Equation (A.5) and Equation (A.6) we can conclude that:\n∑ t∈TG 〈λt, ct(xt)− ρ〉 ≥ |T∅| − 2 ν − RDTG,<τ − R D TG,>τ . (A.7)\nPart 2. Now, let x∗ be the best unconstrained strategy, i.e., x∗ ∈ arg maxx∈X ∑ t∈[T ] ft(x) and thus∑\nt≤T ft(x ∗) := OPTγ .5 Consider the mixed strategy ξ∗ ∈ Ξ that randomizes between x∗ and ∅,\nwith probability ρ+β1+β and 1−ρ 1+β , respetively. Then Ex∼ξ∗ [∑ t∈TG〈λt,ρ− ct(x)〉 ] ≥ 0. This can be easily proved via the following chain of inequalities:\nE x∼ξ∗ [∑ t∈TG 〈λt,ρ− ct(x)〉 ] = ρ+ β 1 + β ∑ t∈TG 〈λt,ρ− ct(x∗)〉+ 1− ρ 1 + β ∑ t∈TG 〈λt,ρ− ct(∅)〉\n= ∑ t∈TG 〈λt,ρ〉 − ρ+ β 1 + β ∑ t∈TG 〈λt, ct(x∗)〉 − 1− ρ 1 + β ∑ t∈TG 〈λt, ct(∅)〉\n≥ ρ ∑ t∈TG ‖λt‖1 − ρ+ β 1 + β ∑ t∈TG ‖λt‖1 + 1− ρ 1 + β β ∑ t∈TG ‖λt‖1\n= ( ρ− ρ+ β\n1 + β + β 1− ρ 1 + β )∑ t∈TG ‖λt‖1\n= 0. (A.8)\nThen, we can use the defintion of the regret of the primal regret minimizer to find that:\nE x∼ξ∗ [∑ t∈TG ft(x) + 〈λt,ρ− ct(x)〉 ] − ∑ t∈TG (ft(xt) + 〈λt,ρ− ct(xt)〉) ≤ RPTG , (A.9)\nand by rearranging and using the inequality of Equation (A.8) we have that:∑ t∈TG ft(xt) + 〈λt,ρ− ct(xt)〉 ≥ E x∼ξ∗ [∑ t∈TG ft(x) ] − RPTG .\nBy building upon this inequality we obtain the following:∑ t∈TG ft(xt) + 〈λt,ρ− ct(xt)〉 ≥ E x∼ξ∗ [∑ t∈TG ft(x) ] − RPTG\n= E x∼ξ∗ ∑ t≤T ft(x)− ∑ t∈T∅ ft(x) − RPTG ≥ E x∼ξ∗ ∑ t≤T ft(x)\n− |T∅| − RPTG = ρ+ β\n1 + β ∑ t≤T ft(x ∗) + 1− ρ 1 + β ∑ t≤T ft(∅)− |T∅| − RPTG\n≥ ρ+ β 1 + β ∑ t≤T ft(x ∗)− |T∅| − RPTG\n= ρ+ β\n1 + β OPTγ − |T∅| − RPTG . (A.10)\n5For simplicity we replaced the supremum with the maximum. Results would continue to hold with sup with minor modifications.\nConcluding. Using the inequality of Equation (A.6) and the inequality of Equation (A.10) we have∑ t≤T ft(xt) ≥ ∑ t∈TG ft(xt)\n≥ ∑ t∈TG 〈λt, ct(xt)− ρ〉+ ρ+ β 1 + β OPTγ − |T∅| − RPTG\n≥ |T∅| − 2\nν − RDTG,<τ − R D TG,>τ +\nρ+ β 1 + β OPTγ − |T∅| − RPTG\n= ρ+ β\n1 + β OPTγ −\n2 ν − RDTG,<τ − R D TG,>τ − R P TG ,\nwhich concludes the proof."
        },
        {
            "heading": "B PROOFS OMITTED FROM SECTION 4.2",
            "text": "Lemma 4.2. For any ξ ∈ Ξ and δ ∈ (0, 1], with probability at least 1− δ, it holds that:∑ t∈T∅ ct,i(∅) ≤ −β|T∅|+MET,δ, ∀i ∈ [m], and (4.1)\nEx∼ξ [∑ t∈TG ft(x) + 〈λt,ρ− ct(x)〉 ] ≥ E x∼ξ [∑ t∈TG f̄(x) + 〈λt,ρ− c̄(x)〉 ] −MET,δ. (4.2)\nProof. We start by proving that the inequality of Equation (4.1) holds with probability 1− δ/2. Let K = |T∅|. Then, we can easily see that, for i ∈ [m], with probability 1− δ/(2mT )∑\nk∈[K]\n(ck,i(∅)− c̄i(∅)) ≤ √ 2K log ( 4mT\nδ\n) ≤ √ 2T log ( 4mT\nδ\n) ,\nwhere the first inequality holds by Hoeffding’s bound. By taking a union bound over all possible lengths of T∅ (which are T ) and i ∈ [m], we obtain that for all possible sets T∅ it holds:∑\nt∈T∅\n(ct,i(∅)− c̄i(∅)) ≤ √ 2T log ( 4mT\nδ ) with probability at least 1− δ/2. Then the proof of the inequality of Equation (4.1) is concluded by observing that: ∑\nt∈T∅\nc̄i(∅) ≤ −β|T∅|,\nand that √\n2T log (4mT/δ) ≤MET,δ . Equation (4.2) can be proved in a similar way. Indeed, for any fixed TG of size K = |TG|, and for any strategy mixture ξ, by Hoeffding we have that with probability at least 1− δ/2T the following holds\nE x∼ξ [∑ t∈TG ft(x) + 〈λt,ρ− ct(x)〉 ] ≥ E x∼ξ [∑ t∈TG f̄(x) + 〈λt,ρ− c̄(x)〉 ] − (1 + 2M) √ K 2 log ( 4T δ )\n≥ E x∼ξ [∑ t∈TG f̄(x) + 〈λt,ρ− c̄(x)〉 ] − (1 + 2M) √ T 2 log ( 4T δ )\n≥ E x∼ξ [∑ t∈TG f̄(x) + 〈λt,ρ− c̄(x)〉 ] −MET,δ.\nBy taking a union bound over all possible T lengths of TG, we obtain that for all possible sets TG, the equation above holds with probability 1− δ/2. The Lemma follows by a union bound on the two equations above, which hold separately with probability 1− δ/2.\nTheorem 4.3. Let the inputs (ft, ct) be i.i.d. samples from a fixed but unknown distribution P. For δ ∈ (0, 1], we have that with probability at least 1− δ, it holds\nT∑ t=1 ft(xt) ≥ T · OPTLPf̄ ,c̄ − ( 2 ν + 1 ν ET,δ + R D TG,<τ (D) + R D TG,>τ (D) + R P TG ) .\nProof. The proof follows a similar approach to Theorem 4.1 with extra details regarding concentration inequalities to exploit stochasticity of the environment. We sketch here the proof for the sake of clarity. In order to simplify the notation of the proof, we will write RDTG,<τ (resp., R D TG,>τ ) in place of RDTG,<τ (D) (resp., R D TG,>τ (D)).\nPart 1. In the same fashion as the proof of Theorem 4.1, we can define i∗ to be the index of the resource that had budget less then 1 at round τ , and show that∑\nt≤τ−1\nct,i∗(xt) > B − 1, (B.1)\nwhich is exactly Equation (A.1) from Theorem 4.1. Moreover, in rounds t ∈ T∅ ⊂ [τ ] we have that xt = ∅, and by Equation (4.1) we obtain∑\nt∈T∅\nct,i∗(∅) ≤ −β|T∅|+ ET,δ, (B.2)\nwhich follows Equation (A.1) from Theorem 4.1, with the addition of the ET,δ term (see definition in Section 4.2), due to the concentration inequality. Then, since [τ ] = T∅ ∪ TG,<τ , by combining Equation (B.1) and Equation (B.2) we can conclude that:∑\nt∈TG,<τ ct,i∗(xt) = ∑ t≤τ ct,i∗(xt)− ∑ t∈T∅ ct,i∗(xt) ≥ B − 2 + β|T∅| − ET,δ. (B.3)\nThen, through a chain of inequalities similar to the one of Equation (A.5) we can conclude that∑ t∈TG,<τ 〈λt, ct(xt)− ρ〉 ≥ |T∅| − 2 ν − 1 ν ET,δ − RDTG,<τ . (B.4)\nThe same arguments used for Equation A.6 readily imply that∑ t∈TG 〈λt, ct(xt)− ρ〉 ≥ |T∅| − 2 ν − 1 ν ET,δ − RDTG,<τ − R D TG,>τ . (B.5)\nPart 2. Define ξ∗ to be the optimal stochastic policy that achieves OPTLP f̄ ,c̄ = supξ∈Ξ Ex∼ξ[f̄(x)] and Ex∼ξ[c(x)] ρ. By the definition of regret of AP on the rounds TG with respect to ξ∗ the following holds ∑\nt∈TG ft(xt) + 〈λt,ρ− ct(xt)〉 ≥ Ex∼ξ∗ [∑ t∈TG ft(x) + 〈λt,ρ− ct(x)〉 ] − RPTG\n≥ Ex∼ξ∗ [∑ t∈TG f̄(x) + 〈λt,ρ− c̄(x)〉 ] − RPTG − ET,δ ≥ T · OPTLPf̄ ,c̄ − |T∅| − R P TG − ET,δ, (B.6)\nwhere we used Equation (4.1) in the first inequality, and [T ] = TG ∪ T∅ in the third one.\nConcluding. By combining Equation (B.5) and Equation (B.6) we can conclude that:∑ t≤T ft(xt) ≥ T · OPTLPf̄ ,c̄ − R P TG − 2 ν − 1 ν ET,δ − RDTG,<τ − R D TG,>τ . (B.7)\nwhich concludes the proof."
        },
        {
            "heading": "C PROOFS OMITTED FROM SECTION 5",
            "text": "Lemma 5.5. Assume that the dual regret minimizer is OGD on Rm+ with η = (k1ET,δ + k2mEPT,δ + 2m √ T )−1, where k1, k2 are absolute constants, and the primal regret minimizer AP satisfies Condition 5.4. Then, both in the adversarial and stochastic setting, the Lagrange multipliers λt played by the dual regret minimizer AD are such that M := supt∈[T ] ‖λt‖1 ≤ 8m/ν.\nProof. We will address the stochastic and adversarial case separately. First, we focus on the stochastic case. The adversarial case will follow via minor modifications.\nStochastic setting. We prove the theorem by contradiction. Suppose that there exists a round t2 such that ‖λt2‖1 ≥ 8m/ν, and let t1 ∈ [t2] be the the first round such that ‖λt1‖1 ≥ 1/ν. Notice that the dual regret minimizer AD (i.e., OGD) guarantees that:\n‖λt1‖1 ≤ 1 ν +mη ≤ 2 ν and ‖λt2‖1 ≤ 8m ν +mη ≤ 9m ν ,\nsince the dual losses are in [−1, 1]m, and by assumption ‖λt1−1‖1 ≤ 1/ν and ‖λt2−1‖1 ≤ 8m/ν. Hence, the range of payoffs of the primal regret minimizer |uPt | in the interval T := {t1, . . . , t2} can be bounded as follows\nsup x∈X ,t∈T |uPt (x)| ≤ sup x∈X ,t∈T\n{ |ft(x)|+ ‖λt‖1 · ‖ρ− ct(x)‖∞ } ≤ 1 + 29m\nν ≤ 19m ν .\nTherefore, by assumption, the regret of the primal regret minimizer is at most: RPT ≤ ( 19m\nν\n)2 EPT,δ.\nSimilarly to the proof of Lemma 4.2, by applying a Hoeffding’s bound to all the intervals and a union bound, we get that, with probability at least 1− δ, it holds∑\nt∈T 〈λt, ct(∅)〉 ≤ ∑ t∈T 〈λt, c̄(∅)〉+ 9m ν ET,δ\n≤ −β ∑ t∈T ‖λt‖1 + 9m ν ET,δ. (C.1)\nThen, by the no-regret property of the primal regret minimizer we have∑ t∈T (ft(xt)− 〈λt, ct(xt)− ρ〉) ≥ ∑ t∈T (ft(∅)− 〈λt, ct(∅)− ρ〉)− ( 19m ν )2 EPT,δ\n≥ ∑ t∈T ft(∅) + β ∑ t∈T ‖λt‖1 + ∑ t∈T 〈λt,ρ〉 − ( 9m ν ) ET,δ − ( 19m ν )2 EPT,δ\n≥ ν ∑ t∈T ‖λt‖1 − ( 9m ν ) ET,δ − ( 19m ν )2 EPT,δ\n≥ (t2 − t1)− ( 9m\nν\n) ET,δ − ( 19m\nν\n)2 EPT,δ, (C.2)\nwhere in the second inequality we use Equation (C.1) and in the last one we use that ‖λt‖1 ≥ 1/ν for t ∈ T . For each resource i ∈ [m], we consider two cases: i) the dual regret minimizer never has to perform a projection operation during T , and ii) t̃i ∈ T is the last time in which λti,i = 0. In both cases, we show that ∑\nt∈T 〈λt,ρ− ct(xt)〉 ≤ ∑ i∈[m] [ λt1,i − λt2,i ην ]− + 5m ν2η . (C.3)\nIn the first case, since we are using OGD as the dual regret minimizer and, by assumption, it never has to perform projections during T , it holds that for all resources i ∈ [m]:\nλt2,i = η ∑ t∈T (ct,i(xt)− ρ) + λt1,i.\nNow consider the Lagrange multiplier λ∗ such that, for each i ∈ [m],\nλ∗i :=\n{ 1/ν if ∑ t∈T (ct,i(xt)− ρ) ≥ 0\n0 otherwise . (C.4)\nBy exploiting Lemma 5.3 for a single component i ∈ [m], we have that:∑ t∈T (λ∗i − λt,i)(ct,i(xt)− ρ) ≤ (λ∗i − λt1,i)2 2η + 1 2 ηT, (C.5)\nwhich yields the following∑ t∈T λt,i · (ρ− ct,i(xt)) ≤ ∑ t∈T λ∗i · (ρ− ct,i(xt)) + (λ∗i − λt1,i)2 2η + 1 2 ηT\n≤ 1 ν\n[ λt1,i − λt2,i\nη\n]− + (λ∗i − λt1,i)2\n2η +\n1 2 ηT. (C.6)\nThen, since ‖λt1−1‖1 ≤ 1/ν by construction, it holds λt1−1,i ≤ 1/ν. Hence, since the dual regret minimizer is OGD and its utilities are in [−1, 1]m, it holds\nλt1,i ≤ 1\nν + η. (C.7)\nThen, we have (λ∗i − λt1,i)2\n2η ≤ (max{λ ∗ i , λt1,i}) 2 2η ≤ 1 2η\n( 1\nν + η\n)2 .\nIt is easy to verify that for all ν, T , and η ≤ 1 2 √ T :6\n1\n2η\n( 1\nν + η\n)2 + 1\n2 ηT ≤ 5 ν2η ,\nwhich implies that ∑ t∈T λt,i, ρ− ct,i(xt) ≤ 1 ν [ λt1,i − λt2,i η ]− + 5 ν2η .\nIn the second case we define t̃i as the last time step t ∈ [t1, t2] in which λt = 0. Thus, the following holds: λt2,i = η ∑\nt∈[t̃i,t2]\n(ct,i(xt)− ρ). (C.8)\nNow, consider the Lagrange multipliers λi,1 = 0 and λi,2 = 1ν . By Lemma 5.3, we have that the regret of the dual regret minimizer with respect to 0 over [t1, t̃i] is bounded by:∑\nt∈[t1,t̃i−1]\nλt,i(ρ− ct,i(xt)) ≤ ( λ1,i − λ∗i,1 )2 2η + 1 2 ηT ≤ ( 1 ν + η )2 2η + 1 2 ηT, (C.9)\nwhere in the last inequality we use Equation (C.7).\nSimilarly, on the interval [t̃i + 1, t2] we have that the regret of the dual regret minimizer with respect to 1/ν is bounded by\n∑ t∈[t̃i,t2] (λi,2 − λt,i) · (ct,i(xt)− ρ) ≤\n( λ∗i,2 − λt̃i,i )2 2η + 1 2 ηT ≤ 1 2η 1 ν2 + 1 2 ηT,\n6Notice that the definition of η satisfies η ≤ 1 2 √ T .\nwhich can be rearranged into∑ t∈[t̃i,t2] λt,i · (ρ− ct,i(xt)) ≤ 1 ν ∑ t∈[t̃i,t2] (ρ− ct,i(xt)) + 1 2η 1 ν2 + 1 2 ηT\n= −λt2,i ην + 1 2η 1 ν2 + 1 2 ηT\n≤ [ λt1,i − λt2,i\nην\n]− + 1\n2η\n1\nν2 +\n1 2 ηT (C.10)\nwhere the equality follows from Equation (C.8) and the last inequality from −x ≤ min(y − x, 0) for x, y ≥ 0. Then by summing Equation (C.9) and Equation (C.10) we obtain\n∑ t∈[t1,t2] λt,i · (ρ− ct,i(xt)) ≤ [ λt1,i − λt2,i ην ]− + ( 1 ν + η )2 2η + 1 2ην2 + ηT. (C.11)\nIf we take η ≤ 1 2 √ T , then the following inequality holds for all ν and T :7( 1 ν + η )2 2η + 1 2ην2 + ηT ≤ 5 ν2η .\nThis concludes the second case and concludes the proof of Equation (C.3).\nNow we can sum over all resources i ∈ [m] and conclude that:∑ t∈T 〈λt,ρ− ct(xt)〉 ≤ ∑ i∈[m] [ λt1,i − λt2,i ην ]− + 5m ην2\n≤ ‖λt1‖1 − ‖λt2‖1 ην + 5m ην2\n≤ − 6m ν2η + 5m ην2 = − m ν2η .\nFinally, the cumulative utility of the primal regret minimizer over T is bounded by∑ t∈[t1,t2] (ft(xt) + 〈λt,ρ− ct(xt)〉) ≤ (t2 − t1)− m ν2η . (C.12)\nBy putting Equation (C.2) and Equation (C.12) together we have that\n(t2 − t1)− m\nν2η ≥ (t2 − t1)−\n( 9m\nν\n) ET,δ − ( 19m\nν\n)2 EPT,δ\n≥ (t2 − t1)− ( 9m\nν\n) ET,δ − ( 19m\nν\n)2 EPT,δ.\nHence,\nm ν2η ≤ ( 9m ν ) ET,δ + ( 19m ν )2 EPT,δ. (C.13)\nwhich holds by the assumption that there exists a time t2 such that ‖λt2‖1 ≥ 8mν .\n7Notice that the definition of η satisfies η ≤ 1 2 √ T .\nThus, if we set\nη := (\n18ET,δ + 361mE P T,δ + 2m\n√ T )−1 ,\nwe reach a contradiction with Equation (C.13) by observing that\nm ν2η = m ν2\n( 18ET,δ + 361mE P T,δ +mν √ T ) > ( 9m\nν\n) ET,δ + ( 19m\nν\n)2 EPT,δ.\nThis concludes the proof for the stochastic setting.\nAdversarial setting. In the adversarial setting all the passages above still apply by setting ET,δ = 0. This is because, using Assumption 2.1, we can refrain from using the concentration inequality originating the term ET,δ .\nThis concludes the proof.\nCorollary 5.6. Assume that the dual regret minimizer is OGD on Rm+ with η = (k1ET,δ +k2mEPT,δ + 2m √ T )−1, where k1, k2 are absolute constants, and the primal regret minimizer AP satisfies Condition 5.4. Then, in the adversarial setting, Algorithm 1 guarantees with probability 1− δ that∑ t∈[T ] ft(xt) ≥ α · OPTγ − k3 m4 ν2 ( EPT,δ + ET,δ ) ,\nwhere k3 is an absolute constant and α = ν/1+β. In the stochastic setting, there is an absolute constant k4 such that Algorithm 1 guarantees that, with probability at least 1− 2δ,∑\nt∈[T ]\nft(xt) ≥ T · OPTLPf̄ ,c̄ − k4 m4 ν2 ( EPT,δ + ET,δ ) .\nProof. Lemma 5.5 allows us to bound the `1-norm of the Lagrange multipliers which are played by ‖λt‖1 ≤ 8m/ν. This fact, by using Lemma 5.3, readily gives a bound on the terms RDTG<τ (D) and RDTG>τ (D) by observing that\nsup λ,λ′,\n‖λ‖1,‖λ′‖1≤ 8mν ,\n‖λ− λ′‖22 ≤ 64m3\nν2 .\nThis, together with the definition of η = (k1ET,δ + k2mE P T,δ + 2m\n√ T )−1 yields the bound\nmax(RDTG<τ ,R D TG>τ ) ≤\n32m3\nν2 (k1ET,δ + k2mE\nP T,δ + 2m\n√ T ) + m\n2\nT\nk1ET,δ + k2mE P T,δ + 2m\n√ T\n= k1 32m3\nν2 ET,δ + k2\n32m4\nν2 EPT,δ +\n32m4\nν\n√ T + 1\n4\n√ T\n≤ k3 2\nm4\nν2\n( ET,δ + E P T,δ + √ T ) .\nThen, by Condition 5.4 and Lemma 5.5, the regret of the primal regret minimizer AP is bounded by: RPTG ≤ ( 1 + 16m\nν\n)2 EPT (C.14)\n= k4 m2\nν2 EPT . (C.15)\nThis concludes the proof by leveraging Theorem 4.1 and Theorem 4.3."
        }
    ],
    "year": 2023
}